RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
  ssid.toUpperCase();
  password = "My" + ssid;


  // RoSchmi new
  // Extra parameters to be configured
  // After connecting, parameter.getValue() will get you the configured value
  // Format: <ID> <Placeholder text> <default value> <length> <custom HTML> <label placement>
  
  ESPAsync_WMParameter p_azureAccountName(AzureAccountName_Label, "Azure Storage Account Name", azureAccountName, 20);
  ESPAsync_WMParameter p_azureAccountKey(AzureAccountKey_Label, "Azure Storage Account Key", "", 90);
  ESPAsync_WMParameter p_viessmannClientId(ViessmannClientId_Label, "Viessmann Client Id", viessmannClientId, 50);
  ESPAsync_WMParameter p_viessmannRefreshToken(ViessmannRefreshToken_Label, "Viessmann Refresh Token", "", 60);
  ESPAsync_WMParameter p_soundSwitcherThreshold(SoundSwitcherThresholdString_Label, "Noise Threshold", sSwiThresholdStr, 6);
  // Just a quick hint
  ESPAsync_WMParameter p_hint("<small>*Hint: if you want to reuse the currently active WiFi credentials, leave SSID and Password fields empty. <br/>*Portal Password = MyESP_'hexnumber'</small>");
  ESPAsync_WMParameter p_hint2("<small><br/>*Hint: to enter the Azure Key, Viessmann Client Id and Viessmann Refresh Token send them to your Phone by E-Mail and use copy and paste.<br/></small>");
    
  //add all parameters here
  ESPAsync_wifiManager.addParameter(&p_hint);
  ESPAsync_wifiManager.addParameter(&p_hint2);
  ESPAsync_wifiManager.addParameter(&p_azureAccountName);
  ESPAsync_wifiManager.addParameter(&p_azureAccountKey);
  ESPAsync_wifiManager.addParameter(&p_viessmannClientId);
  ESPAsync_wifiManager.addParameter(&p_viessmannRefreshToken);
  ESPAsync_wifiManager.addParameter(&p_soundSwitcherThreshold);

  // Check if there are stored WiFi router/password credentials.
  // If not found, device will remain in configuration mode until switched off via webserver.
  Serial.println(F("Opening configuration portal."));
  
  bool configWiFiDataLoaded = false;

  // From v1.1.0, Don't permit NULL password
  if ( (Router_SSID != "") && (Router_Pass != "") )
  {
    LOGERROR3(F("From v1.1.0 * Add SSID = "), Router_SSID, F(", PW = "), Router_Pass);
    wifiMulti.addAP(Router_SSID.c_str(), Router_Pass.c_str());
    ESPAsync_wifiManager.getSSID();
    ESPAsync_wifiManager.setConfigPortalTimeout(60); //If no access point name has been previously entered disable timeout.
    Serial.println(F("Here we could print the Self-Stored Router WiFi-Credentials"));
    //Remove this line if you do not want to see WiFi password printed
    LOGERROR3(F("ESP Self-Stored Credentials :  "), Router_SSID, F(", PW = "), Router_Pass);
  }
  else
  {
    LOGERROR3(F("From v1.1.0 * Neglect ESP-Self_Stored SSID = "), Router_SSID, F(", PW = "), Router_Pass);
  }
  
  if (loadWiFiConfigData())   // Load credentials for Router WiFi STA connection from SPIFFS/LittleFS    
  {
    configWiFiDataLoaded = true;
    
    ESPAsync_wifiManager.setConfigPortalTimeout(60); //If no access point name has been previously entered disable timeout.
    Serial.println(F("Got stored Credentials. Timeout 60s for Config Portal"));
    
    // Added by RoSchmi
    // Store credentials read from file in backstore for later use
    memcpy(&Loaded_WM_config, &WM_config, sizeof(Loaded_WM_config));
    
    LOGERROR(F("Could print Credentials, loaded and saved in backstore"));
    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
    LOGERROR3(F("SSID: "), Loaded_WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), Loaded_WM_config.WiFi_Creds[i].wifi_pw);
    }
    


#if DISPLAY_STORED_CREDENTIALS_IN_CP    // Cave: This directive is alse used in ESPAsync_WiFiManger
    // New. Update Credentials, got from loadWiFiConfigData(), to display on CP
    
    // Cave:dangerous, the passwords should never be shown
    
    ESPAsync_wifiManager.setCredentials(WM_config.WiFi_Creds[0].wifi_ssid, WM_config.WiFi_Creds[0].wifi_pw,
                                        WM_config.WiFi_Creds[1].wifi_ssid, WM_config.WiFi_Creds[1].wifi_pw); 
#endif
    
#if USE_ESP_WIFIMANAGER_NTP      
    if ( strlen(WM_config.TZ_Name) > 0 )
    {
      LOGERROR3(F("Current TZ_Name ="), WM_config.TZ_Name, F(", TZ = "), WM_config.TZ);

  #if ESP8266
      configTime(WM_config.TZ, "pool.ntp.org"); 
  #else
      //configTzTime(WM_config.TZ, "pool.ntp.org" );
      configTzTime(WM_config.TZ, "time.nist.gov", "0.pool.ntp.org", "1.pool.ntp.org");
  #endif   
    }
    else
    {
      Serial.println(F("Current Timezone is not set. Enter Config Portal to set."));
    } 
#endif
  }
  else
  {
    // Enter CP only if no stored SSID on flash and file 
    Serial.println(F("Open Config Portal without Timeout: No stored Credentials."));
    initialConfig = true;
  }

  //RoSchmi must always be true in this App 
  initialConfig = true;

  if (initialConfig)
  {
    Serial.print(F("Starting configuration portal @ "));
    
#if USE_CUSTOM_AP_IP    
    Serial.print(APStaticIP);
#else
    Serial.print(F("192.168.4.1"));
#endif

    Serial.print(F(", SSID = "));
    Serial.print(ssid);
    Serial.print(F(", PWD = "));
    Serial.println(password);

    digitalWrite(LED_BUILTIN, LED_ON); // Turn led on as we are in configuration mode.

    //sets timeout in seconds until configuration portal gets turned off.
    //If not specified device will remain in configuration mode until
    //switched off via webserver or device is restarted.
    //ESPAsync_wifiManager.setConfigPortalTimeout(600);

    // Starts an access point, --> open the access point and enter Router WiFi Credentials
    
    if (!ESPAsync_wifiManager.startConfigPortal((const char *) ssid.c_str(), password.c_str()))
    {
      Serial.println(F("Not connected to WiFi but continuing anyway."));
    }
    else
    {
      Serial.println(F("WiFi connected...yeey :)"));
    }

    // Stored  for later usage, from v1.1.0, but clear first
    // Clear the struct. The former content from file is saved in 'Loaded_WM_config'
    memset(&WM_config, 0, sizeof(WM_config));
    
    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
      String tempSSID = ESPAsync_wifiManager.getSSID(i);
      String tempPW   = ESPAsync_wifiManager.getPW(i);
      
