RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
      if (tempSSID.isEmpty())
      {
        tempSSID = Loaded_WM_config.WiFi_Creds[i].wifi_ssid;       
      }
      
      if (tempPW.isEmpty())
      {
        tempPW = Loaded_WM_config.WiFi_Creds[i].wifi_pw;
      }
      
      // Check if length of SSID and password fit into the place in the struct
      if (strlen(tempSSID.c_str()) < sizeof(WM_config.WiFi_Creds[i].wifi_ssid) - 1)
        strcpy(WM_config.WiFi_Creds[i].wifi_ssid, tempSSID.c_str());
      else
        strncpy(WM_config.WiFi_Creds[i].wifi_ssid, tempSSID.c_str(), sizeof(WM_config.WiFi_Creds[i].wifi_ssid) - 1);
      if (strlen(tempPW.c_str()) < sizeof(WM_config.WiFi_Creds[i].wifi_pw) - 1)
        strcpy(WM_config.WiFi_Creds[i].wifi_pw, tempPW.c_str());
      else
        strncpy(WM_config.WiFi_Creds[i].wifi_pw, tempPW.c_str(), sizeof(WM_config.WiFi_Creds[i].wifi_pw) - 1);  

      // Don't permit NULL SSID and password len < MIN_AP_PASSWORD_SIZE (8)
      if ( (String(WM_config.WiFi_Creds[i].wifi_ssid) != "") && (strlen(WM_config.WiFi_Creds[i].wifi_pw) >= MIN_AP_PASSWORD_SIZE) )
      {
        LOGERROR3(F("To Multi-List added: SSID = "), WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), WM_config.WiFi_Creds[i].wifi_pw );
        wifiMulti.addAP(WM_config.WiFi_Creds[i].wifi_ssid, WM_config.WiFi_Creds[i].wifi_pw);
      }     
    }
#if USE_ESP_WIFIMANAGER_NTP      
    String tempTZ   = ESPAsync_wifiManager.getTimezoneName();

    if (strlen(tempTZ.c_str()) < sizeof(WM_config.TZ_Name) - 1)
      strcpy(WM_config.TZ_Name, tempTZ.c_str());
    else
      strncpy(WM_config.TZ_Name, tempTZ.c_str(), sizeof(WM_config.TZ_Name) - 1);

    const char * TZ_Result = ESPAsync_wifiManager.getTZ(WM_config.TZ_Name);
    
    if (strlen(TZ_Result) < sizeof(WM_config.TZ) - 1)
      strcpy(WM_config.TZ, TZ_Result);
    else
      strncpy(WM_config.TZ, TZ_Result, sizeof(WM_config.TZ_Name) - 1);
         
    if ( strlen(WM_config.TZ_Name) > 0 )
    {
      LOGERROR3(F("Saving current TZ_Name ="), WM_config.TZ_Name, F(", TZ = "), WM_config.TZ);

#if ESP8266
      configTime(WM_config.TZ, "pool.ntp.org"); 
#else
      //configTzTime(WM_config.TZ, "pool.ntp.org" );
      configTzTime(WM_config.TZ, "time.nist.gov", "0.pool.ntp.org", "1.pool.ntp.org");
#endif
    }
    else
    {
      LOGERROR(F("Current Timezone Name is not set. Enter Config Portal to set."));
    }
#endif

    ESPAsync_wifiManager.getSTAStaticIPConfig(WM_STA_IPconfig);
    LOGERROR(F("Here we could print Router WiFi Credentals saved to file"));
    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
      LOGERROR3(F("Saved SSID: "), WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), WM_config.WiFi_Creds[i].wifi_pw );
    }
    saveWiFiConfigData();
  }

  // Getting posted form values and overriding local variables parameters
  // Config file is written regardless the connection state 
  strcpy(azureAccountName, p_azureAccountName.getValue());
  if (strlen(p_azureAccountKey.getValue()) > 1)
  {
    strcpy(azureAccountKey, p_azureAccountKey.getValue());
  }
  if (strlen(p_viessmannClientId.getValue()) > 1)
  {
    strcpy(viessmannClientId, p_viessmannClientId.getValue());
  }
  if (strlen(p_viessmannRefreshToken.getValue()) > 1)
  {
    strcpy(viessmannRefreshToken, p_viessmannRefreshToken.getValue());
  }
  strcpy(sSwiThresholdStr, p_soundSwitcherThreshold.getValue());
    
    // Writing JSON config file to flash for next boot

  saveApplConfigData();

  digitalWrite(LED_BUILTIN, LED_OFF); // Turn led off as we are not in configuration mode.

  

  startedAt = millis();



  // Azure Acount must be updated here with eventually changed values from WiFi-Manager
  myCloudStorageAccount.ChangeAccountParams((char *)azureAccountName, (char *)azureAccountKey, UseHttps_State);
  
  #if WORK_WITH_WATCHDOG == 1
    // Start watchdog with 20 seconds
    if (esp_task_wdt_init(20, true) == ESP_OK)
    {
      Serial.println(F("\r\nWatchdog enabled with interval of 20 sec\r\n"));
    }
    else
    {
      Serial.println(F("Failed to enable watchdog"));
    }
    esp_task_wdt_add(NULL);

    //https://www.az-delivery.de/blogs/azdelivery-blog-fur-arduino-und-raspberry-pi/watchdog-und-heartbeat

    //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/wdts.html
  #endif

   if ( WiFi.status() != WL_CONNECTED )
    {
      Serial.println(F("ConnectMultiWiFi in setup"));

      connectMultiWiFi();
    }

    Serial.print(F("After waiting "));
  Serial.print((float) (millis() - startedAt) / 1000);
  Serial.print(F(" secs more in setup(), connection result is "));

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
  }
  else
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));

  uint8_t status;
  int i = 0;
  status = wifiMulti.run();
             
  delay(800L);  //(WIFI_MULTI_1ST_CONNECT_WAITING_MS) 

  if ( status == WL_CONNECTED )
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
  }
  else
  {
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));
    #if WORK_WITH_WATCHDOG == 1
      while (true)  // Wait to be rebooted by watchdog
      {
        delay(100);
      }
    #endif
  }

  /*
  while (true)
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
    delay (1000);
  }
  */

  soundSwitcher.begin(atoi((char *)sSwiThresholdStr), Hysteresis::Percent_10, soundSwitcherUpdateInterval, soundSwitcherReadDelayTime);
  soundSwitcher.SetCalibrationParams(-20.0);  // optional
  soundSwitcher.SetActive();
  //**************************************************************
  onOffDataContainer.begin(DateTime(), OnOffTableName_1, OnOffTableName_2, OnOffTableName_3, OnOffTableName_4);

  // Initialize State of 4 On/Off-sensor representations 
  // and of the inverter flags (Application specific)
  for (int i = 0; i < 4; i++)
  {
    onOffDataContainer.PresetOnOffState(i, false, true);
    onOffDataContainer.Set_OutInverter(i, true);
    onOffDataContainer.Set_InputInverter(i, false);
  }

  //Initialize OnOffSwitcher (for tests and simulation)
  onOffSwitcherWio.begin(TimeSpan(15 * 60));   // Toggle every 30 min
  //onOffSwitcherWio.SetInactive();
  onOffSwitcherWio.SetActive();

