RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
  if ((pAiOnTheEdgeApiSelectionPtr ->lastReadTime.operator+(pAiOnTheEdgeApiSelectionPtr -> readInterval)).operator<(dateTimeUTCNow))
  {
    char myUriEndpoint[50] = {0}; 
    strncpy(myUriEndpoint, "http://gasmeter/json", sizeof(myUriEndpoint) - 1);
    
    httpCode = readJsonFromRestApi(myX509Certificate, (const char *)myUriEndpoint, sizeof(myUriEndpoint), pAiOnTheEdgeApiSelectionPtr);   
    
    if (httpCode == t_http_codes::HTTP_CODE_OK)
    {
      pAiOnTheEdgeApiSelectionPtr -> lastReadTime = dateTimeUTCNow;  
    }
    else
    {
      pAiOnTheEdgeApiSelectionPtr ->lastReadTime = dateTimeUTCNow;
      Serial.println(F("Failed to read Features from Ai-On-The-Edge-Device")); 
      Serial.println((char*)bufferStorePtr);
    }
  }
   
  if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
  {
    //printf("\nAnalogSensorMgr: Value is used %d\n", pSensorIndex);
    for (int i = 0; i < AI_FEATURES_COUNT; i++)
    {       
      if (strcmp((const char *)ai_features[i].name, pSensorName) == 0)
      {       
        returnFeature = ai_features[i];
        analogSensorMgr.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.value), 0.0f, MAGIC_NUMBER_INVALID);                         
        break;
      }     
    } 
  }
  return returnFeature;
}

ViessmannApiSelection::Feature ReadViessmannApi_Analog_01(int pSensorIndex, const char* pSensorName)
{
  
  // Use values read from the Viessmann API
  // pSensorIndex determins the position (from 4). pSensorName is the name of the feature (see ViessmannApiSelection.h)
  
  // preset a 'returnFeature' with value = MAGIC_NUMBER_INVALID (999.9)
  ViessmannApiSelection::Feature returnFeature;
  strncpy(returnFeature.value, (floToStr(MAGIC_NUMBER_INVALID)).c_str(), sizeof(returnFeature.value) - 1);
  
  // Only read features from the cloud when readInterval has expired
  
  if ((viessmannApiSelection.lastReadTime.operator+(viessmannApiSelection.readInterval)).operator<(dateTimeUTCNow))
  { 
    httpCode = readViessmannFeaturesFromApi(myX509Certificate, myViessmannApiAccountPtr, Data_0_Id, Gateways_0_Serial, Gateways_0_Devices_0_Id, viessmannApiSelectionPtr);
    if (httpCode == t_http_codes::HTTP_CODE_OK)
    {
      viessmannApiSelection.lastReadTime = dateTimeUTCNow;
      Serial.println(F("Succeeded to read Features from Viessmann Cloud\n"));
    }
    else
    {
      viessmannApiSelection.lastReadTime = dateTimeUTCNow;
      Serial.println(F("Failed to read Features from Viessmann Cloud")); 
      //Serial.println((char*)bufferStorePtr);
    }
  }
  
  if (analogSensorMgr_Api_01.HasToBeRead(pSensorIndex, dateTimeUTCNow))
  {
    //Serial.printf("\nAnalogSensorMgr_Api_01: Value is used %d\n", pSensorIndex); 
      
    for (int i = 0; i < VI_FEATURES_COUNT; i++)
    {       
      if (strcmp((const char *)features[i].name, pSensorName) == 0)
      {
        returnFeature = features[i];
        analogSensorMgr_Api_01.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.value), 0.0f, MAGIC_NUMBER_INVALID);           
        break;
      }
    } 
  } 
  return returnFeature;
}

ValueStruct ReadAnalogSensorStruct_01(int pSensorIndex)
{
  ValueStruct returnValueStruct = { 
      .displayValue = (float)MAGIC_NUMBER_INVALID,
      .unClippedValue = (float)MAGIC_NUMBER_INVALID};

  char consumption[12] = {0};

  if (pSensorIndex == 1)
  {
    //Serial.println("In ReadAnalogSensorStruct_01 pSensorIndex == 1");
  }
    
//if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
//{

  if (pSensorIndex == 1)
  {
    //Serial.println("Nach has to be Read pSensorIndex == 1 noch vorhanden");
  }

  switch(pSensorIndex)
  {
      case 0:
      { 
        // Total Consumption, DisplayValue and UnClippedValue 
        AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;                      
        // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
        AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(1, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
        strncpy(consumption, selectedFeature.value, sizeof(consumption));                                          
        float tempNumber = (atof((const char *)consumption));
        tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : tempNumber;
        if (tempNumber > (MAGIC_NUMBER_INVALID - 0.01) && tempNumber < (MAGIC_NUMBER_INVALID + 0.01))
        {
          //return both with MAGIC_NUMBER_INVALID
          return returnValueStruct;
        }
        sprintf(consumption, "%.1f", tempNumber * 10);
        returnValueStruct.unClippedValue = atof((const char *)consumption);
        
        while (strlen(consumption) > 4)
        {
            memmove(consumption, consumption + 1, strlen(consumption));
        }
        returnValueStruct.displayValue = atof((const char *)consumption);
        
        selectedFeature = ReadAiOnTheEdgeApi_Analog_01(1, (const char *)"pre", aiOnTheEdgeApiSelectionPtr);
        strncpy(consumption, selectedFeature.value, sizeof(consumption));                                          
        tempNumber = (atof((const char *)consumption));
        sprintf(consumption, "%.1f", tempNumber * 10);
        
        //#if SERIAL_PRINT == 1
            printf("\nDisplayValue: %.1f  UnClippedValue: %.1f\n", returnValueStruct.displayValue, returnValueStruct.unClippedValue);
        //#endif                                                                                                                        
      }
      break;                   
      case 1:
      {
        // Calculate Day-Consumption from BaseValue and UnClippedValue 
        float copyBaseValue = dataContainer.SampleValues[0].BaseValue;
        float copyUnClippedValue = dataContainer.SampleValues[0].UnClippedValue;
        Serial.printf("\n Case 1: BaseValue: %.1f UnclippedValue: %.1f\n", copyBaseValue, copyUnClippedValue);
        //returnValueStruct.displayValue = (copyUnClippedValue - copyBaseValue) * 10;
        returnValueStruct.displayValue = (copyUnClippedValue - copyBaseValue);  
        returnValueStruct.unClippedValue = copyUnClippedValue;                      
        Serial.printf("\nDay-Consumption: %.1f\n", returnValueStruct.displayValue);                      
      }
      break;
      case 2:
      {
        uint32_t sendIntervalSeconds = dataContainer.SendInterval.totalseconds();
        uint32_t LastSendTimeSeconds = dataContainer._lastSentTime.secondstime();       
        
