RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
        Serial.printf("LastSendTime: %d Actual: %.d Diff: %d Interval: %d Remain %d\n", LastSendTimeSeconds,  
          dateTimeUTCNow.secondstime(), dateTimeUTCNow.secondstime() - LastSendTimeSeconds, sendIntervalSeconds, 
        LastSendTimeSeconds + sendIntervalSeconds - dateTimeUTCNow.secondstime());


        //if (dataContainer._hasToBeSent)
        
        
        //if (dateTimeUTCNow.secondstime() > (LastSendTimeSeconds + sendIntervalSeconds))
        //{
          // Calculate rate when sendinterval has elapsed
          
          float copyLastSendUnClippedValue = dataContainer.SampleValues[0].LastSendUnClippedValue;
          float copyUnClippedValue = dataContainer.SampleValues[0].UnClippedValue;                 
          //TimeSpan timeSinceLastSend = dateTimeUTCNow.operator-(dataContainer._lastSentTime);
          
          uint32_t timeSinceLastSendSeconds = dateTimeUTCNow.secondstime() - LastSendTimeSeconds;
          
          float rate = 0.0;
          if (copyUnClippedValue != copyLastSendUnClippedValue)
          {
            if (timeSinceLastSendSeconds > 1.0)
            {             
              rate = (copyUnClippedValue - copyLastSendUnClippedValue) * 50.0f / ((float)timeSinceLastSendSeconds / 60.0f); // * 100 gives reasonable size         
            }
          }

          printf("LastSendValue: %.1f Actual: %.1f Diff: %.1f Seconds: %d\n", copyLastSendUnClippedValue, 
            copyUnClippedValue, copyUnClippedValue - copyLastSendUnClippedValue, timeSinceLastSendSeconds);  
          
          printf("\n Flow is: %.1f per minute. Read after: %d seconds\n\n", rate, timeSinceLastSendSeconds);
          
          returnValueStruct.displayValue = rate;
          returnValueStruct.unClippedValue = copyUnClippedValue;
        //}
        //else
        //{
        //    printf("\nNot sent\n");
        //}

                     
         // if (rate > -0.1 && rate < 0.1)
         // {
         //   returnValueStruct.displayValue = (float)MAGIC_NUMBER_INVALID;        
         // }
          
          
        //}                     
      }
      break;
      case 3:
      {

          // in the forth graph show Viessmann Vorlauftemperatur
          
          //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
          //returnValueStruct.displayValue = featureValueSet.SampleValues[1].Value;
          //returnValueStruct.unClippedValue = returnValueStruct.displayValue;
                     
          // This is an alternative way to get a Viessmann Api Sensor valu                      
          
          //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
          //theRead = featureValueSet.SampleValues[1].Value;
          
                      
          //theRead = atoi((char *)sSwiThresholdStr) / 10; // dummy
          //Show ascending lines from 0 to 5, so re-boots of the board are indicated                                                
          //theRead = ((double)(insertCounterAnalogTable % 50)) / 10;
          returnValueStruct.displayValue = ((float)(insertCounterAnalogTable % 50)) / 10;
          returnValueStruct.unClippedValue = 0.0;                      
      }                   
      break;
    }
  //}

    return returnValueStruct;
}
  

float ReadAnalogSensor_01(int pSensorIndex)
{
#ifndef USE_SIMULATED_SENSORVALUES
            // Use values read from an analog source
            // Change the function for each sensor to your needs
            // This is an an adaption for a gasmeter
              
              //RoSchmi: Next line was deleted
              //static float unclippedBaseValue_01 = 0.0;
              double theRead = MAGIC_NUMBER_INVALID;           
              if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
              {                              
                switch (pSensorIndex)
                {
                  case 0:
                    { 
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(1, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                        
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 4 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : tempNumber * 10;
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }
                      

                      int32_t timeDiffUtcToLocal = localTime.secondstime() - dateTimeUTCNow.secondstime();                   
                      bool isNewDay = dateTimeUTCNow.operator+(timeDiffUtcToLocal).day() != dataContainer._lastSentTime.operator+(timeDiffUtcToLocal).day();
                      
                      //uint8_t dayUTC = dateTimeUTCNow.day();
                      //uint8_t daylocal = localTime.day();

                      Serial.printf("\n\nTimeDiffInSeconds: %d \n\n", timeDiffUtcToLocal);

                      if (dataContainer._isFirstTransmission || isNewDay)
                      {
                        dataContainer._baseValue = atof((const char *)consumption);                
                      }
                                                                
                      theRead = atof((const char *)consumption) / 100;
                     
                      // As an example we use it here to display an analog value read from the Viessmann Api   
                      
