RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
  AiOnTheEdgeClient aiOnTheEdgeClient(pCaCert, httpPtr, wifi_client);
  
  Serial.printf("\r\n(%u) ", loadGasMeterJsonCount);
  Serial.printf("%i/%02d/%02d %02d:%02d ", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
  
  char url[pUrlMaxlength + 1] = {0};
  strncpy(url, pUrl, pUrlMaxlength);
     
   Serial.printf("readJsonFromRestApi: %s\n", (const char *)url);

  t_httpCode responseCode = aiOnTheEdgeClient.GetFeatures((const char *)url, bufferStorePtr, bufferStoreLength, apiSelectionPtr);
  loadGasMeterJsonCount++;
  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
    // Populate features array and replace the name read from Api
    // with the name used in this Application
    
    ai_features[0] = apiSelectionPtr ->_0_value;
    ai_features[1] = apiSelectionPtr ->_1_raw;
    ai_features[2] = apiSelectionPtr ->_2_pre;
    ai_features[3] = apiSelectionPtr ->_3_error;
    ai_features[4] = apiSelectionPtr ->_4_rate;
    ai_features[5] = apiSelectionPtr ->_5_timestamp;      
  }
  return responseCode;
} 

t_httpCode readViessmannFeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, const uint32_t data_0_id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr)
{  
  #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

  #if VIESSMANN_TRANSPORT_PROTOCOL == 1 
    wifi_client.setCACert(myX509Certificate);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  memset(bufferStorePtr, '\0', bufferStoreLength);
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);
  Serial.printf("\r\n(%u) ",loadViFeaturesCount);
  Serial.printf("%i/%02d/%02d %02d:%02d ", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
  t_httpCode responseCode = viessmannClient.GetFeatures(bufferStorePtr, bufferStoreLength, data_0_id, Gateways_0_Serial, Gateways_0_Devices_0_Id, apiSelectionPtr);
  
  Serial.printf("(%u) Viessmann Features: httpResponseCode is: %d\r\n", loadViFeaturesCount, responseCode);
  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
    loadViFeaturesCount++;
    // After each successful request error counters are reset
    loadViFeaturesResp400Count = 0;
    loadViFeaturesRespOtherCount = 0;

    // Populate features array and replace the name read from Api
    // with the name used in this Application
    features[0] = apiSelectionPtr ->_3_temperature_main;
    strcpy(features[0].name, (const char *)"_3_temperature_main");
    features[1] = apiSelectionPtr ->_5_boiler_temperature;
    strcpy(features[1].name, (const char *)"_5_boiler_temperature");
    features[2] = apiSelectionPtr ->_7_burner_modulation;
    strcpy(features[2].name, (const char *)"_7_burner_modulation");
    features[3] = apiSelectionPtr ->_8_burner_hours;
    strcpy(features[3].name, (const char *)"_8_burner_hours");
    features[4] = apiSelectionPtr ->_8_burner_starts;
    strcpy(features[4].name, (const char *)"_8_burner_starts");
    features[5] = apiSelectionPtr ->_9_burner_is_active;
    strcpy(features[5].name, (const char *)"_9_burner_is_active");
    features[6] = apiSelectionPtr ->_23_heating_curve_shift;
    strcpy(features[6].name, (const char *)"_23_heating_curve_shift");
    features[7] = apiSelectionPtr ->_23_heating_curve_slope;
    strcpy(features[7].name, (const char *)"_23_heating_curve_slope");
    features[8] = apiSelectionPtr ->_77_temperature_supply;
    strcpy(features[8].name, (const char *)"_77_temperature_supply");
    features[9] = apiSelectionPtr ->_85_heating_dhw_charging;
    strcpy(features[9].name, (const char *)"_85_heating_dhw_charging");
    features[10] = apiSelectionPtr ->_86_heating_dhw_pump_status;
    strcpy(features[10].name, (const char *)"_86_heating_dhw_pump_status");
    features[11] = apiSelectionPtr ->_88_heating_dhw_pump_primary_status;
    strcpy(features[11].name, (const char *)"_88_heating_dhw_pump_primary_status");
    features[12] = apiSelectionPtr ->_90_heating_dhw_cylinder_temperature;
    strcpy(features[12].name, (const char *)"_90_heating_dhw_cylinder_temperature");
    features[13] = apiSelectionPtr ->_92_heating_dhw_outlet_temperature;
    strcpy(features[13].name, (const char *)"_92_heating_dhw_outlet_temperature");
    features[14] = apiSelectionPtr ->_93_heating_dhw_main_temperature;
    strcpy(features[14].name, (const char *)"_93_heating_dhw_main_temperature");
    features[15] = apiSelectionPtr ->_95_heating_temperature_outside;
    strcpy(features[15].name, (const char *)"_95_heating_temperature_outside");
    
    // Get 4 On/Off sensor values which were read from the Viessmann Api
    // and store them in a 'twin' of the sensor, reflecting its state 
    OnOffBurnerStatus.Feed(strcmp((const char *)(apiSelectionPtr ->_9_burner_is_active.value), (const char *)"true") == 0, dateTimeUTCNow);
    OnOffCirculationPumpStatus.Feed(strcmp((const char *)(apiSelectionPtr ->_11_circulation_pump_status.value), (const char *)"on") == 0, dateTimeUTCNow);
    OnOffHotWaterCircualtionPumpStatus.Feed(strcmp((const char *)(apiSelectionPtr ->_86_heating_dhw_pump_status.value), (const char *)"on") == 0, dateTimeUTCNow);
    OnOffHotWaterPrimaryPumpStatus.Feed(strcmp((apiSelectionPtr -> _88_heating_dhw_pump_primary_status.value), (const char *)"on") == 0, dateTimeUTCNow);   
  }
  else
  {
    
    if (responseCode == 400)
    {
      loadViFeaturesResp400Count++;
    }
    else
    {
      loadViFeaturesRespOtherCount++;
    }
    Serial.printf("Bad httpResponses, Code 400: %d, Others: %d\n", loadViFeaturesCount, loadViFeaturesRespOtherCount);
  
    if (loadViFeaturesResp400Count > 5 || loadViFeaturesRespOtherCount > 5)
    {
      Serial.printf("Rebooting, failed Vi-Requests. 400: %d, others: %d\n", loadViFeaturesResp400Count, loadViFeaturesRespOtherCount);
      ESP.restart();
      while(true)
      {
        delay(500); //Wait for ever
      }
    }

